# 1. Створіть послідовність інструкцій, яка отримує рядок від користувача та друкує кожне третє слово з цього рядка. Цикл не використовувати
# 2. Створити генератор списка
#  Вхідний список [1,2.1,"f","2",3,"1",18, "df"]
#  Вихідний список [1,2.1,-1,'6',9,'3',18,-1]
# 3. Як на такі елементи потрапляютьз вхідного до вихідного списку:
#  1. Елемент типу Float
#  2. Елемент типу int та є парним
#  3. Елемент типу int та є непарним. Додатково звести у 2 ступінь. Приклад елемент 3 > 9
#  4. Елемент типу str лише цифри. Додатково помножити на 3. Приклад елемент 2 > 6
#  5. В інших випадках замість елемента підстав число -1.
#########################################################################################
text = input("write")
print(list(text.split(" "))[2::3])
# new_list = [<Exp1> if condition else <Exp2> if condition else <Exp3> for <item> in <iterable <<<<<делал по примеру и старался соблювадать PEP8
mix_list = [1, 2.1, "f", "2", 3, "1", 18, "df"]
gen_list = [el if type(el) == int and el % 2 == 0
                else el ** 2 if type(el) == int and el % 2 == 1
                    else el if type(el) == float
                        else str(int(el)*3) if type(el) == str and el.isdigit()
                            else -1 for el in mix_list]
print(gen_list)
print(type(gen_list))
